# Data Aggregation and Group Operations

Categorizing a dataset and applyting a function to each group, whether an aggregation or transformation, is often a critical component of a data analyzis workflow. After loading, merging and preparing a dataset, you may need to compute group statistics of possible _pivot tables_ for reporting or visualization purposes. pandas provides a flexible __groupby__ interface, enableing you to slice, dice, and summarize datasets in a natural way.

In [1]:
import numpy as np
import pandas as pd

## GroupBy Mechanism

In [2]:
df = pd.DataFrame({'key1': ['a','a','b','b','a'],
                  'key2': ['one','two','one','two','one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.424475 -0.458710
1    a  two -0.348589  1.868267
2    b  one -0.298792  0.409445
3    b  two  0.267867  0.454862
4    a  one -0.602079  0.327484

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped # The grouped variable is now a GroupBy object

In [6]:
grouped.mean()

key1
a   -0.175398
b   -0.015463
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [8]:
means

key1  key2
a     one    -0.088802
      two    -0.348589
b     one    -0.298792
      two     0.267867
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a    -0.088802 -0.348589
b    -0.298792  0.267867

In [10]:
states = np.array(['Ohio','Calofornia','California','Ohio','Ohio'])

In [11]:
years = np.array([2005,2005,2006,2005,2006])

In [12]:
df['data1'].groupby([states,years]).mean()

California  2006   -0.298792
Calofornia  2005   -0.348589
Ohio        2005    0.346171
            2006   -0.602079
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.175398  0.579014
b    -0.015463  0.432154

In [14]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.088802 -0.065613
     two  -0.348589  1.868267
b    one  -0.298792  0.409445
     two   0.267867  0.454862

In [15]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### Iterating Over Groups

In [17]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.424475 -0.458710
1    a  two -0.348589  1.868267
4    a  one -0.602079  0.327484
b
  key1 key2     data1     data2
2    b  one -0.298792  0.409445
3    b  two  0.267867  0.454862

In [20]:
for (k1,k2), group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.424475 -0.458710
4    a  one -0.602079  0.327484
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.348589  1.868267
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.298792  0.409445
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.267867  0.454862

In [21]:
pieces = dict(list(df.groupby('key1')))

In [22]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.298792  0.409445
3    b  two  0.267867  0.454862

In [24]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped = df.groupby(df.dtypes,axis=1)

In [26]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.424475 -0.458710
1 -0.348589  1.868267
2 -0.298792  0.409445
3  0.267867  0.454862
4 -0.602079  0.327484
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### Selecting a Column or Subset of Columns

In [27]:
df.groupby('key1')['data1']

In [28]:
df.groupby('key1')['data2']

In [29]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.065613
     two   1.868267
b    one   0.409445
     two   0.454862

In [30]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [31]:
s_grouped

In [32]:
s_grouped.mean()

key1  key2
a     one    -0.065613
      two     1.868267
b     one     0.409445
      two     0.454862
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [34]:
b = 14

In [36]:
c = 21

In [37]:
d = 24

### Grouping with Functions

### Grouping by Index Levels

## Data Aggregation

### Column-Wise and Multiple Function Application

### Returning Aggregated Data Without Row Indexes

## Apply: General split-apply-combine

### Suppressing the Group Keys

### Quantile and Bucket Analysis

### Example: Filling Missign Values with Group-Specific Values

### Example: Random Sampling and Permutation

### Example: Group Weighted Average and Correlation

### Example: Group-Wise Linear Regression

## Pivot Tables and Cross-Tabulation

### Cross-Tabulation: Crossstab